tap "1password/tap"
tap "homebrew/bundle"
tap "knqyf263/pet"
tap "koyeb/tap"
tap "teamookla/speedtest"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "freetype"
brew "gettext"
brew "ccache"
brew "cmake"
brew "cowsay"
brew "docbook"
brew "docbook2x"
brew "expat"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libssh"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gdbm"
brew "gh"
brew "git"
brew "go"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "libheif"
brew "imagemagick"
brew "imlib2"
brew "jq"
brew "libiconv"
brew "libzip"
brew "lolcat"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "numpy", link: false
brew "nvm"
brew "oh-my-posh"
brew "openssl@1.1"
brew "openssl@3.0"
brew "openvino"
brew "poppler"
brew "pdfgrep"
brew "php"
brew "pkg-config"
brew "python@3.11"
brew "qemu"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "stow"
brew "stylua"
brew "tcl-tk"
brew "tmux"
brew "toilet"
brew "tree"
brew "ttyd"
brew "vhs"
brew "wget"
brew "xmlto"
brew "yarn"
brew "zlib"
brew "zsh-autosuggestions"
brew "knqyf263/pet/pet"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "aws-vault"
cask "discord"
cask "docker"
cask "dropbox"
cask "font-roboto-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "miniconda"
cask "shortcat"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "wireshark"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "idleberg.applescript"
vscode "joaompinto.vscode-graphviz"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "silesky.toggle-boolean"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tht13.rst-vscode"
vscode "tomoki1207.pdf"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
