tap "ankitpokhrel/jira-cli"
tap "charmbracelet/tap"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "joerdav/xc"
tap "knqyf263/pet"
tap "turbot/tap"
brew "icu4c"
brew "node"
brew "aws-cdk", link: false
brew "aws-vault"
brew "awscli"
brew "bat"
brew "glib"
brew "cdk"
brew "cntlm"
brew "cowsay"
brew "duckdb"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpgme"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gum"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "openjdk@11"
brew "poppler"
brew "pdfgrep"
brew "pre-commit"
brew "prettier"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "stow"
brew "swagger-codegen"
brew "tmux"
brew "tree"
brew "ttyd"
brew "vhs"
brew "wget"
brew "zsh-autocomplete"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "charmbracelet/tap/freeze"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "joerdav/xc/xc"
brew "knqyf263/pet/pet"
brew "turbot/tap/steampipe"
cask "anaconda"
cask "aws-vpn-client"
cask "docker"
cask "dotnet"
cask "git-credential-manager"
cask "iterm2"
cask "miniconda"
cask "postman"
cask "shortcat"
cask "slack"
cask "sublime-text"
cask "visual-studio-code"
cask "warp"
cask "zed"
vscode "4a454646.github-purple"
vscode "a-h.templ"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "avetis.tokyo-night"
vscode "bierner.markdown-preview-github-styles"
vscode "charliermarsh.ruff"
vscode "davidsanders.search-under-cursor"
vscode "dbaeumer.vscode-eslint"
vscode "dionannd.tokyo-night-ported-nvim"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "launchdarklyofficial.launchdarkly"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nacholaciar.tokyo-midnight"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "sainoba.px-to-rem"
vscode "shaharkazaz.git-merger"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "silesky.toggle-boolean"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "sukemoritech.tokyo-dive"
vscode "swnb.swnb-material-palenight-theme"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
